# Tests Generator

Затрагиваемые темы
- Метапрограммирование: анализ исходного кода и его генерация с использованием Roslyn.
- Многопоточное программирование с использованием высокоуровневых библиотек.
- Асинхронное программирование в .NET: async/await.
- Модульное тестирование.

Необходимо реализовать многопоточный генератор шаблонного кода тестовых классов для одной из библиотек для тестирования (NUnit, xUnit, MSTest) по тестируемым классам.
#
__Входные данные__ 

- Список файлов, для классов из которых необходимо сгенерировать тестовые классы.
- Путь к папке для записи созданных файлов.
- Ограничения на секции конвейера (см. далее).
#
__Выходные данные__

- Файлы с тестовыми классами: в каждом выходном файле должен быть только один тестовый класс, соответствующий одному тестируемому классу, вне зависимости от того, как были расположены тестируемые классы в исходных файлах. 
Например: Input.cs (с классами Foo и Bar) -> FooTests.cs, BarTests.cs.
- Все сгенерированные тестовые классы должны компилироваться при включении в отдельный проект, в котором имеется ссылка на проект с тестируемыми классами.
- Все сгенерированные тесты должны завершаться с ошибкой.
#
__Схема работы__

Генерация должна выполняться в конвейерном режиме "производитель-потребитель" и состоять из трех этапов: 
1. параллельная загрузка исходных текстов в память (с ограничением количества файлов, загружаемых за раз);
2. генерация тестовых классов в многопоточном режиме (с ограничением максимального количества одновременно обрабатываемых задач); 
3. параллельная запись результатов на диск (с ограничением количества одновременно записываемых файлов).

__При реализации использовать async/await и асинхронный API. Для реализации конвейера использовать Dataflow API.__

Главный метод генератора должен возвращать Task и не выполнять никаких ожиданий внутри (блокирующих вызовов task.Wait(), task.Result, etc). Для ввода-вывода также необходимо использовать асинхронный API.

Необходимо сгенерировать по одному пустому тесту на каждый публичный метод тестируемого класса. Следует учитывать перегрузку методов (несколько методов с одинаковыми именами, но разными параметрами).

Для синтаксического разбора и генерации исходного кода следует использовать Roslyn.


#
__Пример исходного класса и сгенерированных тестов для NUnit__

___Исходный класс:___
```
using System;

namespace MyCode
{
    public class MyClass
    {
        public void FirstMethod()
        {
            Console.WriteLine("First method");
        }
        
        public void SecondMethod()
        {
            Console.WriteLine("Second method");
        }
        
        public void ThirdMethod(int a)
        {
            Console.WriteLine("Third method (int)");
        }
        
        public void ThirdMethod(double a)
        {
            Console.WriteLine("Third method (double)");
        }
    }
}   
```
___Сгенерированные тесты:___
```
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using NUnit.Framework;
using MyCode;

namespace MyCode.Tests
{
    [TestFixture]
    public class MyClassTests
    {
        [Test]
        public void FirstMethodTest()
        {
            Assert.Fail("autogenerated");
        }

        [Test]
        public void SecondMethodTest()
        {
            Assert.Fail("autogenerated");
        }
        
        [Test]
        public void ThirdMethod1Test()
        {
            Assert.Fail("autogenerated");
        }
        
        [Test]
        public void ThirdMethod2Test()
        {
            Assert.Fail("autogenerated");
        }
    }
}

```

#
__Организация кода__

Код лабораторной работы должен состоять из трех проектов:
- Библиотека для генерации тестовых классов, содержащая логику по разбору исходного кода и многопоточной генерации классов.
- Модульные тесты для главной библиотеки.
- Консольная программа, содержащая логику по чтению входных данных, загрузке исходных файлов в память и записи результатов работы (сгенерированных тестовых классов) в файлы.





